## Plan Result (1112: stg_aria - Terraform Plan Apply)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 7 to add, 9 to change, 6 to destroy.</code></pre>

* Create
  * azurerm_eventhub.aria_active_topic[&#34;00-ack&#34;]
  * azurerm_eventhub.aria_active_topic[&#34;00-pub&#34;]
  * azurerm_eventhub_authorization_rule.aria_active_topic_sas[&#34;00-ack&#34;]
  * azurerm_eventhub_authorization_rule.aria_active_topic_sas[&#34;00-pub&#34;]
  * azurerm_key_vault_secret.eventhub_active_topic_secrets[&#34;00-ack&#34;]
  * azurerm_key_vault_secret.eventhub_active_topic_secrets[&#34;00-pub&#34;]
  * local_file.config[&#34;00&#34;]
* Update
  * azurerm_linux_function_app.example[&#34;00-af-active-ccd&#34;]
  * azurerm_linux_function_app.example[&#34;00-af-aplfpa&#34;]
  * azurerm_linux_function_app.example[&#34;00-af-aplfta&#34;]
  * azurerm_linux_function_app.example[&#34;00-af-apluta&#34;]
  * azurerm_linux_function_app.example[&#34;00-af-bails&#34;]
  * azurerm_linux_function_app.example[&#34;00-af-joh&#34;]
  * azurerm_linux_function_app.example[&#34;00-af-sbails&#34;]
  * azurerm_linux_function_app.example[&#34;00-af-td&#34;]
  * azurerm_storage_account.xcutting[&#34;00&#34;]
* Delete
  * azurerm_eventhub.aria_active_topic[&#34;00-active-ack&#34;]
  * azurerm_eventhub.aria_active_topic[&#34;00-active-pub&#34;]
  * azurerm_eventhub_authorization_rule.aria_active_topic_sas[&#34;00-active-ack&#34;]
  * azurerm_eventhub_authorization_rule.aria_active_topic_sas[&#34;00-active-pub&#34;]
  * azurerm_key_vault_secret.eventhub_active_topic_secrets[&#34;00-active-ack&#34;]
  * azurerm_key_vault_secret.eventhub_active_topic_secrets[&#34;00-active-pub&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # data.azurerm_storage_account_sas.xcutting["00"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_storage_account_sas" "xcutting" {
      + connection_string = (sensitive value)
      + expiry            = "2027-12-31T23:59:59Z"
      + https_only        = true
      + id                = (known after apply)
      + sas               = (sensitive value)
      + start             = "2024-01-01T00:00:00Z"

      + permissions {
          + add     = true
          + create  = true
          + delete  = true
          + filter  = false
          + list    = true
          + process = true
          + read    = true
          + tag     = true
          + update  = true
          + write   = true
        }

      + resource_types {
          + container = true
          + object    = true
          + service   = true
        }

      + services {
          + blob  = true
          + file  = true
          + queue = true
          + table = true
        }
    }

  # azurerm_eventhub.aria_active_topic["00-ack"] will be created
  + resource "azurerm_eventhub" "aria_active_topic" {
      + id                  = (known after apply)
      + message_retention   = 7
      + name                = "evh-active-ack-00-uks-dlrm-01"
      + namespace_id        = (known after apply)
      + namespace_name      = "ingest00-integration-eventHubNamespace001-stg"
      + partition_count     = 2
      + partition_ids       = (known after apply)
      + resource_group_name = "ingest00-main-stg"
      + status              = "Active"
    }

  # azurerm_eventhub.aria_active_topic["00-active-ack"] will be destroyed
  # (because key ["00-active-ack"] is not in for_each map)
  - resource "azurerm_eventhub" "aria_active_topic" {
      - id                  = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg/providers/Microsoft.EventHub/namespaces/ingest00-integration-eventHubNamespace001-stg/eventhubs/evh-active-ack-00-uks-dlrm-01" -> null
      - message_retention   = 1 -> null
      - name                = "evh-active-ack-00-uks-dlrm-01" -> null
      - namespace_id        = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg/providers/Microsoft.EventHub/namespaces/ingest00-integration-eventHubNamespace001-stg" -> null
      - namespace_name      = "ingest00-integration-eventHubNamespace001-stg" -> null
      - partition_count     = 2 -> null
      - partition_ids       = [
          - "0",
          - "1",
        ] -> null
      - resource_group_name = "ingest00-main-stg" -> null
      - status              = "Active" -> null
    }

  # azurerm_eventhub.aria_active_topic["00-active-pub"] will be destroyed
  # (because key ["00-active-pub"] is not in for_each map)
  - resource "azurerm_eventhub" "aria_active_topic" {
      - id                  = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg/providers/Microsoft.EventHub/namespaces/ingest00-integration-eventHubNamespace001-stg/eventhubs/evh-active-pub-00-uks-dlrm-01" -> null
      - message_retention   = 1 -> null
      - name                = "evh-active-pub-00-uks-dlrm-01" -> null
      - namespace_id        = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg/providers/Microsoft.EventHub/namespaces/ingest00-integration-eventHubNamespace001-stg" -> null
      - namespace_name      = "ingest00-integration-eventHubNamespace001-stg" -> null
      - partition_count     = 2 -> null
      - partition_ids       = [
          - "0",
          - "1",
        ] -> null
      - resource_group_name = "ingest00-main-stg" -> null
      - status              = "Active" -> null
    }

  # azurerm_eventhub.aria_active_topic["00-pub"] will be created
  + resource "azurerm_eventhub" "aria_active_topic" {
      + id                  = (known after apply)
      + message_retention   = 7
      + name                = "evh-active-pub-00-uks-dlrm-01"
      + namespace_id        = (known after apply)
      + namespace_name      = "ingest00-integration-eventHubNamespace001-stg"
      + partition_count     = 2
      + partition_ids       = (known after apply)
      + resource_group_name = "ingest00-main-stg"
      + status              = "Active"
    }

  # azurerm_eventhub_authorization_rule.aria_active_topic_sas["00-ack"] will be created
  + resource "azurerm_eventhub_authorization_rule" "aria_active_topic_sas" {
      + eventhub_name                     = "evh-active-ack-00-uks-dlrm-01"
      + id                                = (known after apply)
      + listen                            = true
      + manage                            = true
      + name                              = "aria_manage_sas"
      + namespace_name                    = "ingest00-integration-eventHubNamespace001-stg"
      + primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      + primary_key                       = (sensitive value)
      + resource_group_name               = "ingest00-main-stg"
      + secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      + secondary_key                     = (sensitive value)
      + send                              = true
    }

  # azurerm_eventhub_authorization_rule.aria_active_topic_sas["00-active-ack"] will be destroyed
  # (because key ["00-active-ack"] is not in for_each map)
  - resource "azurerm_eventhub_authorization_rule" "aria_active_topic_sas" {
      - eventhub_name                     = "evh-active-ack-00-uks-dlrm-01" -> null
      - id                                = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg/providers/Microsoft.EventHub/namespaces/ingest00-integration-eventHubNamespace001-stg/eventhubs/evh-active-ack-00-uks-dlrm-01/authorizationRules/aria_manage_sas" -> null
      - listen                            = true -> null
      - manage                            = true -> null
      - name                              = "aria_manage_sas" -> null
      - namespace_name                    = "ingest00-integration-eventHubNamespace001-stg" -> null
      - primary_connection_string         = (sensitive value) -> null
      - primary_key                       = (sensitive value) -> null
      - resource_group_name               = "ingest00-main-stg" -> null
      - secondary_connection_string       = (sensitive value) -> null
      - secondary_key                     = (sensitive value) -> null
      - send                              = true -> null
        # (2 unchanged attributes hidden)
    }

  # azurerm_eventhub_authorization_rule.aria_active_topic_sas["00-active-pub"] will be destroyed
  # (because key ["00-active-pub"] is not in for_each map)
  - resource "azurerm_eventhub_authorization_rule" "aria_active_topic_sas" {
      - eventhub_name                     = "evh-active-pub-00-uks-dlrm-01" -> null
      - id                                = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg/providers/Microsoft.EventHub/namespaces/ingest00-integration-eventHubNamespace001-stg/eventhubs/evh-active-pub-00-uks-dlrm-01/authorizationRules/aria_manage_sas" -> null
      - listen                            = true -> null
      - manage                            = true -> null
      - name                              = "aria_manage_sas" -> null
      - namespace_name                    = "ingest00-integration-eventHubNamespace001-stg" -> null
      - primary_connection_string         = (sensitive value) -> null
      - primary_key                       = (sensitive value) -> null
      - resource_group_name               = "ingest00-main-stg" -> null
      - secondary_connection_string       = (sensitive value) -> null
      - secondary_key                     = (sensitive value) -> null
      - send                              = true -> null
        # (2 unchanged attributes hidden)
    }

  # azurerm_eventhub_authorization_rule.aria_active_topic_sas["00-pub"] will be created
  + resource "azurerm_eventhub_authorization_rule" "aria_active_topic_sas" {
      + eventhub_name                     = "evh-active-pub-00-uks-dlrm-01"
      + id                                = (known after apply)
      + listen                            = true
      + manage                            = true
      + name                              = "aria_manage_sas"
      + namespace_name                    = "ingest00-integration-eventHubNamespace001-stg"
      + primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      + primary_key                       = (sensitive value)
      + resource_group_name               = "ingest00-main-stg"
      + secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      + secondary_key                     = (sensitive value)
      + send                              = true
    }

  # azurerm_key_vault_secret.eventhub_active_topic_secrets["00-ack"] will be created
  + resource "azurerm_key_vault_secret" "eventhub_active_topic_secrets" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg/providers/Microsoft.KeyVault/vaults/ingest00-meta002-stg"
      + name                    = "evh-active-ack-00-uks-dlrm-01-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "application"  = "dlrm-data-ingest"
          + "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
          + "businessArea" = "cross-cutting"
          + "criticality"  = "High"
          + "environment"  = "staging"
        }
      + value                   = (sensitive value)
      + value_wo                = (write-only attribute)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.eventhub_active_topic_secrets["00-active-ack"] will be destroyed
  # (because key ["00-active-ack"] is not in for_each map)
  - resource "azurerm_key_vault_secret" "eventhub_active_topic_secrets" {
      - id                      = "https://ingest00-meta002-stg.vault.azure.net/secrets/evh-active-ack-00-uks-dlrm-01-key/2a0722ccd3a34ead8042694951e4d71e" -> null
      - key_vault_id            = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg/providers/Microsoft.KeyVault/vaults/ingest00-meta002-stg" -> null
      - name                    = "evh-active-ack-00-uks-dlrm-01-key" -> null
      - resource_id             = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg/providers/Microsoft.KeyVault/vaults/ingest00-meta002-stg/secrets/evh-active-ack-00-uks-dlrm-01-key/versions/2a0722ccd3a34ead8042694951e4d71e" -> null
      - resource_versionless_id = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg/providers/Microsoft.KeyVault/vaults/ingest00-meta002-stg/secrets/evh-active-ack-00-uks-dlrm-01-key" -> null
      - tags                    = {
          - "application"  = "dlrm-data-ingest"
          - "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
          - "businessArea" = "cross-cutting"
          - "criticality"  = "High"
          - "environment"  = "staging"
        } -> null
      - value                   = (sensitive value) -> null
      - value_wo                = (write-only attribute) -> null
      - value_wo_version        = 0 -> null
      - version                 = "2a0722ccd3a34ead8042694951e4d71e" -> null
      - versionless_id          = "https://ingest00-meta002-stg.vault.azure.net/secrets/evh-active-ack-00-uks-dlrm-01-key" -> null
        # (1 unchanged attribute hidden)
    }

  # azurerm_key_vault_secret.eventhub_active_topic_secrets["00-active-pub"] will be destroyed
  # (because key ["00-active-pub"] is not in for_each map)
  - resource "azurerm_key_vault_secret" "eventhub_active_topic_secrets" {
      - id                      = "https://ingest00-meta002-stg.vault.azure.net/secrets/evh-active-pub-00-uks-dlrm-01-key/02a043bda30340a887a4a02e1310f33d" -> null
      - key_vault_id            = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg/providers/Microsoft.KeyVault/vaults/ingest00-meta002-stg" -> null
      - name                    = "evh-active-pub-00-uks-dlrm-01-key" -> null
      - resource_id             = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg/providers/Microsoft.KeyVault/vaults/ingest00-meta002-stg/secrets/evh-active-pub-00-uks-dlrm-01-key/versions/02a043bda30340a887a4a02e1310f33d" -> null
      - resource_versionless_id = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg/providers/Microsoft.KeyVault/vaults/ingest00-meta002-stg/secrets/evh-active-pub-00-uks-dlrm-01-key" -> null
      - tags                    = {
          - "application"  = "dlrm-data-ingest"
          - "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
          - "businessArea" = "cross-cutting"
          - "criticality"  = "High"
          - "environment"  = "staging"
        } -> null
      - value                   = (sensitive value) -> null
      - value_wo                = (write-only attribute) -> null
      - value_wo_version        = 0 -> null
      - version                 = "02a043bda30340a887a4a02e1310f33d" -> null
      - versionless_id          = "https://ingest00-meta002-stg.vault.azure.net/secrets/evh-active-pub-00-uks-dlrm-01-key" -> null
        # (1 unchanged attribute hidden)
    }

  # azurerm_key_vault_secret.eventhub_active_topic_secrets["00-pub"] will be created
  + resource "azurerm_key_vault_secret" "eventhub_active_topic_secrets" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg/providers/Microsoft.KeyVault/vaults/ingest00-meta002-stg"
      + name                    = "evh-active-pub-00-uks-dlrm-01-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "application"  = "dlrm-data-ingest"
          + "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
          + "businessArea" = "cross-cutting"
          + "criticality"  = "High"
          + "environment"  = "staging"
        }
      + value                   = (sensitive value)
      + value_wo                = (write-only attribute)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_linux_function_app.example["00-af-active-ccd"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
          + "AzureWebJobsStorage"                                   = (sensitive value)
          + "FUNCTIONS_EXTENSION_VERSION"                           = "~4"
            # (9 unchanged elements hidden)
        }
        id                                             = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg/providers/Microsoft.Web/sites/af-active-ccd-stg00-uks-dlrm-01"
        name                                           = "af-active-ccd-stg00-uks-dlrm-01"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "High"
            "environment"  = "staging"
        }
        # (33 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_linux_function_app.example["00-af-aplfpa"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
          + "AzureWebJobsStorage"                                   = (sensitive value)
          + "FUNCTIONS_EXTENSION_VERSION"                           = "~4"
          - "WEBSITES_ENABLE_APP_SERVICE_STORAGE"                   = "true" -> null
          - "WEBSITE_ENABLE_SYNC_UPDATE_SITE"                       = "true" -> null
          ~ "WEBSITE_RUN_FROM_PACKAGE"                              = "0" -> "1"
            # (8 unchanged elements hidden)
        }
        id                                             = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg/providers/Microsoft.Web/sites/af-aplfpa-stg00-uks-dlrm-01"
        name                                           = "af-aplfpa-stg00-uks-dlrm-01"
      ~ tags                                           = {
            "application"                            = "dlrm-data-ingest"
            "builtFrom"                              = "hmcts/dlrm-data-ingest-aria"
            "businessArea"                           = "cross-cutting"
            "criticality"                            = "High"
            "environment"                            = "staging"
          - "hidden-link: /app-insights-resource-id" = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg/providers/microsoft.insights/components/af-aplfpa-stg00-uks-dlrm-01" -> null
        }
        # (33 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_linux_function_app.example["00-af-aplfta"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
          + "AzureWebJobsStorage"                                   = (sensitive value)
          + "FUNCTIONS_EXTENSION_VERSION"                           = "~4"
          - "WEBSITES_ENABLE_APP_SERVICE_STORAGE"                   = "true" -> null
          - "WEBSITE_ENABLE_SYNC_UPDATE_SITE"                       = "true" -> null
          ~ "WEBSITE_RUN_FROM_PACKAGE"                              = "0" -> "1"
            # (8 unchanged elements hidden)
        }
        id                                             = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg/providers/Microsoft.Web/sites/af-aplfta-stg00-uks-dlrm-01"
        name                                           = "af-aplfta-stg00-uks-dlrm-01"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "High"
            "environment"  = "staging"
        }
        # (33 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_linux_function_app.example["00-af-apluta"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
          + "AzureWebJobsStorage"                                   = (sensitive value)
          + "FUNCTIONS_EXTENSION_VERSION"                           = "~4"
          - "WEBSITES_ENABLE_APP_SERVICE_STORAGE"                   = "true" -> null
          - "WEBSITE_ENABLE_SYNC_UPDATE_SITE"                       = "true" -> null
          ~ "WEBSITE_RUN_FROM_PACKAGE"                              = "0" -> "1"
            # (8 unchanged elements hidden)
        }
        id                                             = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg/providers/Microsoft.Web/sites/af-apluta-stg00-uks-dlrm-01"
        name                                           = "af-apluta-stg00-uks-dlrm-01"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "High"
            "environment"  = "staging"
        }
        # (33 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_linux_function_app.example["00-af-bails"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
          + "AzureWebJobsStorage"                                   = (sensitive value)
          + "FUNCTIONS_EXTENSION_VERSION"                           = "~4"
          - "WEBSITES_ENABLE_APP_SERVICE_STORAGE"                   = "true" -> null
          - "WEBSITE_ENABLE_SYNC_UPDATE_SITE"                       = "true" -> null
          ~ "WEBSITE_RUN_FROM_PACKAGE"                              = "0" -> "1"
            # (8 unchanged elements hidden)
        }
        id                                             = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg/providers/Microsoft.Web/sites/af-bails-stg00-uks-dlrm-01"
        name                                           = "af-bails-stg00-uks-dlrm-01"
      ~ tags                                           = {
            "application"                            = "dlrm-data-ingest"
            "builtFrom"                              = "hmcts/dlrm-data-ingest-aria"
            "businessArea"                           = "cross-cutting"
            "criticality"                            = "High"
            "environment"                            = "staging"
          - "hidden-link: /app-insights-resource-id" = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg/providers/microsoft.insights/components/af-bails-stg00-uks-dlrm-01" -> null
        }
        # (33 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_linux_function_app.example["00-af-joh"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
          + "AzureWebJobsStorage"                                   = (sensitive value)
          + "FUNCTIONS_EXTENSION_VERSION"                           = "~4"
          - "WEBSITES_ENABLE_APP_SERVICE_STORAGE"                   = "true" -> null
          - "WEBSITE_ENABLE_SYNC_UPDATE_SITE"                       = "true" -> null
          ~ "WEBSITE_RUN_FROM_PACKAGE"                              = "0" -> "1"
            # (8 unchanged elements hidden)
        }
        id                                             = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg/providers/Microsoft.Web/sites/af-joh-stg00-uks-dlrm-01"
        name                                           = "af-joh-stg00-uks-dlrm-01"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "High"
            "environment"  = "staging"
        }
        # (33 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_linux_function_app.example["00-af-sbails"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
          + "AzureWebJobsStorage"                                   = (sensitive value)
          + "FUNCTIONS_EXTENSION_VERSION"                           = "~4"
          - "WEBSITES_ENABLE_APP_SERVICE_STORAGE"                   = "true" -> null
          - "WEBSITE_ENABLE_SYNC_UPDATE_SITE"                       = "true" -> null
          ~ "WEBSITE_RUN_FROM_PACKAGE"                              = "0" -> "1"
            # (8 unchanged elements hidden)
        }
        id                                             = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg/providers/Microsoft.Web/sites/af-sbails-stg00-uks-dlrm-01"
        name                                           = "af-sbails-stg00-uks-dlrm-01"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "High"
            "environment"  = "staging"
        }
        # (33 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_linux_function_app.example["00-af-td"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
          + "AzureWebJobsStorage"                                   = (sensitive value)
          + "FUNCTIONS_EXTENSION_VERSION"                           = "~4"
          - "WEBSITES_ENABLE_APP_SERVICE_STORAGE"                   = "true" -> null
          - "WEBSITE_ENABLE_SYNC_UPDATE_SITE"                       = "true" -> null
          ~ "WEBSITE_RUN_FROM_PACKAGE"                              = "0" -> "1"
            # (8 unchanged elements hidden)
        }
        id                                             = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg/providers/Microsoft.Web/sites/af-td-stg00-uks-dlrm-01"
        name                                           = "af-td-stg00-uks-dlrm-01"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "High"
            "environment"  = "staging"
        }
        # (33 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_storage_account.xcutting["00"] will be updated in-place
  ~ resource "azurerm_storage_account" "xcutting" {
        id                                 = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg/providers/Microsoft.Storage/storageAccounts/ingest00xcuttingstg"
        name                               = "ingest00xcuttingstg"
      ~ tags                               = {
          - "application"  = "dlrm-data-ingest" -> null
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra" -> null
          - "businessArea" = "cross-cutting" -> null
          - "environment"  = "staging" -> null
        }
        # (96 unchanged attributes hidden)

      + network_rules {
          + bypass         = (known after apply)
          + default_action = "Allow"
          + ip_rules       = (known after apply)
        }

        # (3 unchanged blocks hidden)
    }

  # local_file.config["00"] will be created
  + resource "local_file" "config" {
      + content              = jsonencode(
            {
              + env = "stg"
              + lz  = "00"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./tmp/config_stg_00.json"
      + id                   = (known after apply)
    }

Plan: 7 to add, 9 to change, 6 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":190,"Program":"tfcmt","SHA1":"","Target":"1112: stg_aria - Terraform Plan Apply","Vars":{}} -->